app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]

  def index
    savesettings
    filters = session[:table_filters]
    @order = filters[:order]
    @ratings = (filters[:ratings]) ? filters[:ratings].values : []
    @all_ratings = Movie.ratings

   if Movie.column_names.include? @order
---
SELECT "movies".* FROM "movies" WHERE (rating in (NULL)) ORDER BY release_date

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 11]]